lujji/stm8-bare-min/i2c.c
#include "i2c.h"
#include "stm8s.h"

void i2c_init() {
    I2C_FREQR = (1 << I2C_FREQR_FREQ1);
    I2C_CCRL = 0x0A; // 100kHz
    I2C_OARH = (1 << I2C_OARH_ADDMODE); // 7-bit addressing
    I2C_CR1 = (1 << I2C_CR1_PE);
}

void i2c_start() {
    I2C_CR2 |= (1 << I2C_CR2_START);
    while (!(I2C_SR1 & (1 << I2C_SR1_SB)));
}

void i2c_stop() {
    I2C_CR2 |= (1 << I2C_CR2_STOP);
    while (!(I2C_SR3 & (1 << I2C_SR3_MSL)));
}

void i2c_write(uint8_t data) {
    I2C_DR = data;
    while (!(I2C_SR1 & (1 << I2C_SR1_TXE)));
}

void i2c_write_addr(uint8_t addr) {
    I2C_DR = addr;
    while (!(I2C_SR1 & (1 << I2C_SR1_ADDR)));
    (void) I2C_SR3; // check BUS_BUSY
    I2C_CR2 |= (1 << I2C_CR2_ACK);
}

uint8_t i2c_read(uint8_t ack) {
    if (ack)
        I2C_CR2 |= (1 << I2C_CR2_ACK);
    else
        I2C_CR2 &= ~(1 << I2C_CR2_ACK);
    while (!(I2C_SR1 & (1 << I2C_SR1_RXNE)));
    return I2C_DR;
}

void i2c_read_arr(uint8_t *buf, int len) {
    I2C_CR2 |= (1 << I2C_CR2_ACK); // ACK
    while (len > 2) {
        /* Read into buffer */
        while (!(I2C_SR1 & (1 << I2C_SR1_RXNE)));
        *(buf++) = I2C_DR;
        len--;
    }

    /* Read last 2 bytes */
    while (!(I2C_SR1 & (1 << I2C_SR1_RXNE)));
    I2C_CR2 &= ~(1 << I2C_CR2_ACK); // NACK
    i2c_stop();
    *(buf++) = I2C_DR;

    while (!(I2C_SR1 & (1 << I2C_SR1_RXNE)));
    *buf = I2C_DR;
    //I2C_CR2 |= (1 << I2C_ACK); // ACK
}
